namespace Welcome;

public static class HelloUser
{
    public static void Hello()
    {
        string hello = @"
    :::       :::     :::     :::        :::    ::: :::::::::: ::::::::: 
   :+:       :+:   :+: :+:   :+:        :+:   :+:  :+:        :+:    :+: 
  +:+       +:+  +:+   +:+  +:+        +:+  +:+   +:+        +:+    +:+  
 +#+  +:+  +#+ +#++:++#++: +#+        +#++:++    +#++:++#   +#++:++#:    
+#+ +#+#+ +#+ +#+     +#+ +#+        +#+  +#+   +#+        +#+    +#+    
#+#+# #+#+#  #+#     #+# #+#        #+#   #+#  #+#        #+#    #+#     
###   ###   ###     ### ########## ###    ### ########## ###    ###      
";
        for (int i = 0; i < hello.Length; i++)
        {
            Console.Write(hello[i]);
            Thread.Sleep(2);
        }
        Console.WriteLine();
        Console.WriteLine("Добро пожаловать в игру бродилку, что бы пройти лабиринт передвигайте @ стрелками. Что бы выйти нажмите ESC.");
        Console.WriteLine("Нажмите любую клавишу что бы продолжить");
    }
}